# Задание 1
# Необходимо вывести имена всех учеников из списка с новой строки

names = ['Оля', 'Петя', 'Вася', 'Маша']
for name in names:
    print(name)
print() #пустая строка для разделения


# Задание 2
# Необходимо вывести имена всех учеников из списка, рядом с именем показать количество букв в нём
# Пример вывода:
# Оля: 3
# Петя: 4

names = ['Оля', 'Петя', 'Вася', 'Маша']
for name in names:
    letters_count = len(name)
    print(f"{name}: {letters_count}")
print() #пустая строка для разделения

# Задание 3
# Необходимо вывести имена всех учеников из списка, рядом с именем вывести пол ученика

is_male = {
    'Оля': False,  # если False, то пол женский
    'Петя': True,  # если True, то пол мужской
    'Вася': True,
    'Маша': False,
}
names = ['Оля', 'Петя', 'Вася', 'Маша']

for name in names:
    if is_male.get(name) == True:
        gender = 'мужской'
        print(f"{name}: {gender}")
    else:
        gender = 'женский'
        print(f"{name}: {gender}")
print() #пустая строка для разделения

# Задание 4
# Даны группу учеников. Нужно вывести количество групп и для каждой группы – количество учеников в ней
# Пример вывода:
# Всего 2 группы.
# Группа 1: 2 ученика.
# Группа 2: 4 ученика.

groups = [
    ['Вася', 'Маша'],
    ['Вася', 'Маша', 'Саша', 'Женя'],
    ['Оля', 'Петя', 'Гриша'],
]
def group_challenge():
    group_number = 0
    print(f"Всего {len(groups)} группы.")
    for group_number, group in enumerate (groups, 1):
        print(f"Группа {group_number}: {len(group)} ученика.")
group_challenge()
print() #пустая строка для разделения

# Задание 5
# Для каждой пары учеников нужно с новой строки перечислить учеников, которые в неё входят
# Пример вывода:
# Группа 1: Вася, Маша
# Группа 2: Оля, Петя, Гриша

groups = [
    ['Вася', 'Маша'],
    ['Оля', 'Петя', 'Гриша'],
    ['Вася', 'Маша', 'Саша', 'Женя'],
]
group_number = 0
for group_number, group in enumerate (groups, 1):
    print(f"Группа {group_number}: {', '.join(group)}")